Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཤེས་རབ་ཀྱི་དབང་པོ་དབེན་པ་ལ་གནས་པ་འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: “He cultivates the power of wisdom based on detachment, based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །དད་པའི་སྟོབས་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: “He cultivates the strength of faith based on detachment, based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །བརྩོན་འགྲུས་ཀྱི་སྟོབས་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: “He cultivates the strength of diligence based on detachment, based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །དྲན་པའི་སྟོབས་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: “He cultivates the strength of mindfulness based on detachment, based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: “He cultivates the strength of samādhi based on detachment, based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཤེས་རབ་ཀྱི་སྟོབས་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ།
en: “He cultivates the strength of wisdom based on detachment, based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ་འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ།
en: “He cultivates the factor for enlightenment that is mindfulness based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: “He cultivates the factor for enlightenment that is the analysis of phenomena based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: “He cultivates the factor for enlightenment that is diligence based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: “He cultivates the factor for enlightenment that is joy based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །བག་ཡངས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: “He cultivates the factor for enlightenment that is serenity based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: “He cultivates the factor for enlightenment that is samādhi based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤོངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ།
en: “He cultivates the factor for enlightenment that is equanimity based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཡང་དག་པའི་ལྟ་བ་དབེན་པ་ལ་གནས་པ།
en: “He cultivates right view based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཡང་དག་པའི་རྟོག་པ་དབེན་པ་ལ་གནས་པ།
en: “He cultivates right thought based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཡང་དག་པའི་ངག་དབེན་པ་ལ་གནས་པ།
en: “He cultivates right speech based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དབེན་པ་ལ་གནས་པ།
en: “He cultivates right action based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཡང་དག་པའི་འཚོ་བ་དབེན་པ་ལ་གནས་པ།
en: “He cultivates right livelihood based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཡང་དག་པའི་རྩོལ་བ་དབེན་པ་ལ་གནས་པ།
en: “He cultivates right effort based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །ཡང་དག་པའི་དྲན་པ་དབེན་པ་ལ་གནས་པ།
en: “He cultivates right mindfulness based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་བས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ།
en: “He cultivates right samādhi based on detachment, based on absence of desire, based on cessation, and developed by renunciation.

source: །ཡང་དག་པའི་ཏིང་ངེ་འཛིན་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤངས་པས་ཡོངས་སུ་གྲུབ་པ་ཡོངས་སུ་སྒོམ་མོ། །དེ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་ལྟ་བ་དང་། སྔོན་གྱི་སྨོན་ལམ་མངོན་པས་བསྒྲུབས་པར་ཉེ་བར་བརྟེན་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་བཏང་བ་དང་། བྱམས་པ་ཆེན་པོ་དང་ལྡན་པར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་དམིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བསྒྲུབ་ཅིང་རྒྱན་མངོན་པར་གྲུབ་པར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དང་། གཟུགས་དང་མཚན་དང་། དཔེ་བྱད་བཟང་པོ་དང་། དབྱངས་ཀྱི་ཡན་ལག་དང་། གསུང་ཕུན་སུམ་ཚོགས་པ་མངོན་པར་བསྒྲུབ་པ་དང་། གོང་ནས་གོང་དུ་ཁྱད་པར་དུ་འགྱུར་བའི་ཆོས་ཡོངས་སུ་བཙལ་བ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་ཐར་བ་ཟབ་མོ་ཐོས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། ཤེས་རབ་དང་ཐབས་ལ་ཤིན་ཏུ་མཁས་པས་རྣམ་པར་དཔྱོད་པའི་ཕྱིར་རོ།
en: “Those come about by regarding all beings, accomplishing past prayers, having all-preceding great compassion, possessing great love, focusing on omniscient wisdom, creating a buddha realm, creating its adornments, accomplishing a tathāgata’s strengths, confidences, unique buddha qualities, body, primary and secondary signs, aspects of voice, and perfect speech, seeking for higher and higher special Dharmas, hearing and comprehending the profound liberation of the Buddhadharma, and becoming adept in wisdom and methods through analysis.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་འཕྲོ་བ་ཅན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་འདི་འཇིག་ཚོགས་ལ་ལྟ་བ་ལ་སྩོགས་པ་བདག་ཏུ་མངོན་པར་ཆགས་པ་དང་། སེམས་ཅན་དུ་མངོན་པར་ཆགས་པ་དང་། སྲོག་དང་གསོ་བ་དང་། གང་ཟག་དང་། ཤེད་བདག་དང་། ཤེད་ལས་སྐྱེས་པ་ལ་མངོན་པར་ཆགས་པ་དང་། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ལ་མངོན་པར་ཆགས་པ་ལས་བྱུང་བ།
en: “O jinaputras! The bodhisattva on the Brilliance bodhisattva bhūmi knows and has eliminated the view of a self and so on:

source: བརྐྱང་བ་དང་བསྐུམ་པ་དང་། རྣམ་པར་བརྟག་པ་དང་། རྣམ་པར་དཔྱད་པ་དང་དྲན་པ་དང་། བདག་གིར་བྱས་པ་དང་། ནོར་དུ་བྱས་པ་དང་། བརྟེན་པའི་གནས་སུ་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་རབ་ཏུ་ཤེས་སོ། །རབ་ཏུ་སྤོང་ངོ་།
en: the entire mass of attachments to a self, a being, a soul, a spirit, a person, a human, humanity, skandhas, sensory elements, or sensory bases, and to beginnings and endings, examinations, analyses, numbering, possessions, wealth, and habitations.

source: །དེ་འདི་ལྟར་ལས་གང་བྱ་བའི་མི་ཆ་བ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་སྨད་པ། ཀུན་ནས་ཉོན་མོངས་པ་དང་ལྡན་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་སྤོང་ངོ་།
en: “He avoids whatever actions are condemned by the samyak­sambuddhas, any that are endowed with the kleśas.

source: །ལས་གང་བྱ་བའི་རིགས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བསྔགས་པ།
en: He adopts whatever actions are praised by the samyak­sambuddhas.

source: བྱང་ཆུབ་ཀྱི་ལམ་གྱི་ཚོགས་དང་མཐུན་པ་དེ་དག་ཡང་དག་པར་བླངས་ཤིང་གནས་ཏེ།
en: He always practices whatever is conducive to the accumulation of the path to enlightenment.

source: དེ་ཕྱིར་ཞིང་ཇི་ལྟ་ཇི་ལྟར་ཐབས་དང་ཤེས་རབ་ཀྱིས་མངོན་པར་བསྒྲུབས་པའི་ལམ་ཡང་དག་པར་བསྒྲུབ་པའི་ཕྱིར་ལམ་གྱི་ཡན་ལག་རྣམས་བསྒོམ་པ་དེ་ལྟ་དེ་ལྟར་འཇམ་པའི་སེམས་དང་ལྡན་པ་ཡིན། མཉེན་པའི་སེམས་དང་ལྡན་པ་ཡིན་ལས་སུ་རུང་བའི་སེམས་དང་ལྡན་པ་ཡིན། ཕན་པ་དང་བདེ་བ་སྐྱེད་པའི་སེམས་དང་ལྡན་པ་ཡིན། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་སེམས་དང་ལྡན་པ་ཡིན། གོང་ནས་གོང་དུ་ཁྱད་པར་ཡོངས་སུ་ཚོལ་བའི་སེམས་དང་ལྡན་པ་ཡིན། ཡེ་ཤེས་ཀྱི་ཁྱད་པར་ལ་མོས་པའི་སེམས་དང་ལྡན་པ་ཡིན། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་སེམས་དང་ལྡན་པ་ཡིན། བླ་མ་ལ་རིམ་གྲོ་བྱ་བ་དང་མཐུན་པའི་སེམས་དང་ལྡན་པ་ཡིན། ཇི་སྐད་དུ་ཐོས་པའི་ཆོས་ལ་ནན་ཏན་དུ་བྱེད་པའི་སེམས་དང་ལྡན་པ་ཡིན་ཏེ།
en: “Therefore, through following the path he cultivates the aspects of the path and the accomplishment of method and wisdom so that (1) his mind is loving, ( ) his mind is gentle, (3) his mind is adept, (4) his mind brings benefit and happiness, (5) his mind is not afflicted, (6) his mind aspires higher and higher, (7) his mind desires unique wisdom, (8) his mind protects all beings, (9) his mind has reverence for the gurus, and (10) his mind practices the Dharma he has heard.

source: དེ་ནི་བྱས་པ་ཤེས་པས་དྲིན་དུ་གཟོ་བ་ཡིན། འགྲོགས་ན་བདེ་ཞིང་དེས་པ་ཡིན། འཇམ་ཞིང་མཉེན་པ་ཡིན། སྒྱུ་མེད་ཅིང་ང་རྒྱལ་མེད་ལ། ཐིབས་པོ་མེད་པར་སྤྱོད་པ་ཡིན།
en: “He is (1) appreciative, ( ) grateful, (3) pleasant, (4) amiable, (5) candid, (6) tender, (7) sincere, (8) humble, (9) eloquent, and (10) respectful.

source: མཐུན་པར་འཛིན་ཅིང་ང་ལོ་བདེ་བ་ཡིན་ཏེ། དེ་དེ་ལྟར་བཟོད་པ་དང་ལྡན་དེ་ལྟར་དུལ་བ་དང་ལྡན་དེ་ལྟར་ཞི་བ་དང་ལྡན་ཏེ།
en: “Thus he has patience, restraint, and tranquility.

source: དེ་ལྟར་བཟོད་ཅིང་དུལ་ལ་ཞི་བ་དང་ལྡན་པས་གོང་དུས་ཡོངས་སུ་སྦྱོང་བའི་ལས་རྣམས་ཡིད་ལ་བྱེད་ཅིང་ཡང་དག་པར་སྤྱོད་པས་ཕྱིར་མི་ལྡོག་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན། རྒྱུན་མ་ཆད་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན། ཟློག་པར་མི་ནུས་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན། སྐྱོ་བ་མེད་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན། ཡངས་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན།
en: With patience, restraint, and tranquility he focuses on and practices the higher paths of refining the bhūmis.

source: མཐའ་ཡས་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན། ཤིན་ཏུ་སྦྱངས་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན། མི་མཉམ་པ་དང་མཉམ་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན། མི་འཕྲོགས་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན་ཚུལ་དང་མི་ཚུལ་བ་བྱེ་བྲག་ཕྱེད་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་ཡིན་ཏེ། ཕྱིར་ཞིང་དེའི་བསམ་པའི་ཁམས་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: “He has (1) unceasing diligence, ( ) unafflicted diligence, (3) unstoppable diligence, (4) vast diligence, (5) endless diligence, (6) refined diligence, (7) unequaled diligence, (8) invincible diligence, (9) the diligence to ripen all beings, and (10) the diligence that differentiates between good and bad conduct.

source: །ལྷག་པའི་བསམ་པའི་ཁམས་དང་རྣམ་པར་མི་འབྲལ་ལོ། །མོས་པའི་ཁམས་ཀྱང་ཤིན་ཏུ་བྱང་བར་འགྱུར་རོ། །དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བ་ཡང་ཡོངས་སུ་སྐྱེའོ། །འཇིག་རྟེན་གྱི་དྲི་མའི་རྙོག་པ་དང་ཡང་བྲལ་བར་འགྱུར་རོ། །ཐེ་ཙོམ་དང་ཡིད་གཉིས་དང་ནེམ་ནུར་ཡང་རྒྱུན་ཆད་པར་འགྱུར་རོ། །ནེམ་ནུར་མེད་པ་ལ་མངོན་སུམ་དུ་གྱུར་པ་ཡང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །དགའ་བ་དང་བག་ཡངས་ཀྱང་ཡང་དག་པར་འབྱུང་ངོ་། །དེ་བཞིན་གཤེགས་པ་ལ་དད་པ་རླབས་ཆེན་པོ་ཡང་མངོན་སུམ་དུ་འགྱུར་རོ། །སེམས་ཀྱི་བསམ་པ་ཚད་མེད་པ་ཡང་ཡང་དག་པར་སྐྱེའོ།
en: “More than ever before (1) he has purified the element of intention, ( ) he is never apart from the element of superior intention, (3) he has purified the element of motivation, (4) his roots of goodness increase greatly, (5) he has eliminated worldly stains, (6) he has brought uncertainty, equivocation, and skepticism to an end, (7) he becomes completely free from doubts, (8) he becomes completely happy and calm, (9) he is in the presence of the blessings of the tathāgatas, and (10) he perfectly develops an immeasurable motivation in his mind.

source: །དེ་བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་འཕྲོ་བ་ཅན་འདི་ལ་གནས་པའི་ཚེ་ལྟ་བ་རྒྱ་ཆེན་པོ་དང་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་མང་པོ་སྣང་བར་འགྱུར་ཏེ།
en: “When he has reached the Brilliance bodhisattva bhūmi, because of his vast view and the power of his prayers, many buddhas will appear to him.

source: ལྟ་བ་རྒྱ་ཆེན་པོ་དང་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་བརྒྱ་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་སྣང་བར་འགྱུར་རོ།
en: Because of his vast view and the power of his prayers, many hundreds of buddhas, many thousands of buddhas, many hundreds of thousands of buddhas, many millions of buddhas, many tens of millions of buddhas, many billions of buddhas, many tens of billions of buddhas, many trillions of buddhas, and many quintillions of buddhas will appear to him.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་མཐོང་ནས་བསམ་པ་རྒྱ་ཆེན་པོས་རིམ་གྲོ་བྱེད་དོ། །བཀུར་སྟི་བྱེད་དོ། །བསྟི་སྟང་བྱེད་དོ། །མཆོད་པ་བྱེད་དོ། །ན་བཟའ་དང་བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་སྙུན་གྱི་རྐྱེན་སྨན་དང་ཡོ་བྱད་དག་ཀྱང་འབུལ་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་འབུལ་ལོ།
en: He will see those tathāgatas, those arhats, those samyak­sambuddhas, and with a vast motivation he will serve them, worship them, honor them, make offerings to them, and supply them with robes, alms, bowls, beds, medicine for when they are ill, and implements. He will also offer all the articles that bring happiness to a bodhisattva.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་བསྙེན་བཀུར་བ་བྱེད་ཅིང་དེ་དག་གིས་ཆོས་བསྟན་པ་ཡང་རིམ་གྲོར་ཉན་ཅིང་ལེན་ཏོ།
en: “He will honor those tathāgatas, those arhats, those samyak­sambuddhas, and he will serve, listen to, and acquire and hold their teachings.

source: །འཛིན་ཏོ་ཐོས་ནས་ཀྱང་ཅི་ཚུལ་དུ་ནན་ཏན་གྱིས་ཡང་དག་པར་སྒྲུབ་བོ།
en: Having heard their teachings he will correctly and diligently practice them.

source: །དེ་དག་ལས་ཕལ་ཆེར་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་སྟེ། ཕྱིར་ཞིང་དེའི་བསམ་པ་དང་ལྷག་པའི་བསམ་པ་དང་མོས་པ་མཉམ་པ་ཉིད་ཀྱང་རྣམ་པར་དག་པར་འགྱུར་ཏེ།
en: Most who have heard those teachings will become ordained within the teaching, and their thoughts, higher motivation, aspiration, and equanimity will be pure.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་འཕྲོ་བ་ཅན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མར་བསམ་པ་དང་ལྷག་པའི་བསམ་པ་དང་། མོས་པའི་བསམ་པ་མཉམ་པ་ཉིད་རབ་ཏུ་གནས་སོ།
en: “The bodhisattva who is on the Brilliance bodhisattva bhūmi will remain in those thoughts, higher motivation, aspiration, and equanimity for many eons, for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, many millions of eons, many tens of millions of eons, many billions of eons, many tens of billions of eons, many trillions of eons, and many quintillions of eons.

source: །དེའི་དགེ་བའི་རྩ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་དག་ཅིང་ཤིན་ཏུ་འོད་གསལ་བར་འགྱུར་རོ།
en: All his roots of goodness will be pure and extremely bright.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ལྟ་སྟེ་དཔེར་ན། གསེར་གྱི་ས་ལེ་སྦྲམ་དེ་ཉིད་མགར་བ་མཁས་པས་རྒྱན་དུ་བྱས་པ་ནི། དེ་མ་ཡིན་པའི་གསེར་གྱི་ས་ལེ་སྦྲམ་གཞན་རྒྱན་དུ་མ་བྱས་པས་མི་འཕྲོགས་ཤིང་མི་ཐུབ་པ་ཡིན།
en: “O jinaputras, it is like when a skilled smith makes refined gold into jewelry that gold that has not been made into jewelry cannot surpass.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་འཕྲོ་བ་ཅན་འདི་ལ་གནས་པའི་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་དེ་མ་ཡིན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ས་འོག་མ་རྣམས་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བས་མི་འཕྲོགས་ཤིང་མི་ཐུབ་པ་ཡིན།
en: In that same way, the roots of goodness of a bodhisattva who is on the Brilliance bodhisattva bhūmi cannot be superseded or outshone by the roots of goodness of bodhisattvas on the lower bhūmis. “O jinaputras!

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ལྟ་སྟེ་དཔེར་ན་ནོར་བུ་རིན་པོ་ཆེ་འོད་དང་ལྡན་པ་འོད་ཟེར་གྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པ་ཅན་སྣང་བ་རབ་ཏུ་གཏོང་བ་ནི་དེ་མ་ཡིན་པའི་རིན་པོ་ཆེའི་རྣམ་པས་མི་འཕྲོགས་ཤིང་མི་ཐུབ་པ་ཡིན། རླུང་ལངས་པ་དང་ཆུ་དང་ཆར་བབ་པས་འོད་མི་ཆོད་པ་ཡིན།
en: By analogy, a brilliant precious jewel that shines with an aura of light rays cannot be surpassed or outshone by other jewels, and neither wind, water, nor rain can stop it from shining

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་ས་འོད་འཕྲོ་བ་ཅན་འདི་ལ་གནས་པ་ཡང་དེ་མ་ཡིན་པའི་ས་འོག་མ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་མི་འཕྲོགས་ཤིང་མི་ཐུབ་པ་ཡིན། བདུད་དང་ཉོན་མོངས་པའི་རྒྱུད་རྣམས་ཀྱིས་ཡེ་ཤེས་མི་ཆོད་པ་ཡིན། དེའི་བསྡུ་བའི་དངོས་པོ་བཞི་ལས་དོན་མཐུན་པའི་ཤས་ཆེ་བ་ཡིན།
en: “O jinaputras! In the same way a bodhisattva who is on the Brilliance bodhisattva bhūmi cannot be surpassed or outshone by bodhisattvas on the lower bhūmis, and neither māras nor beings with kleśas can stop his wisdom.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་ལས་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཤས་ཆེ་བ་ཡིན་ཏེ། ལྷག་མ་རྣམས་ཀྱང་ཅི་ཚུལ་ཅི་ནུས་སུ་ཡང་དག་པར་མི་སྒྲུབ་པ་མ་ཡིན་ནོ།
en: “From among the ten perfections, the perfection of diligence predominates, and the other perfections are not accomplished fully and completely.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་ས་བཞི་པ་སྟེ་འོད་འཕྲོ་བ་ཅན་ཞེས་བྱའོ།
en: “O jinaputras, this fourth bhūmi of the bodhisattva mahāsattvas is named Brilliance.

source: །དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕལ་ཆེར་ལྷའི་རྒྱལ་པོ་རབ་འཚེ་མར་འགྱུར་ཏེ།
en: “The majority of the bodhisattva mahāsattvas who are on that bhūmi become the deva king Suyāma.

source: སེམས་ཅན་རྣམས་ཀྱི་འཇིག་ཚོགས་ལ་ལྟ་བ་མང་པོ་ཡང་དག་པར་གཞོལ་བ་ལ་མཁས་ཤིང་མཐུ་ཡོད་པ་ཡིན། དེ་སྦྱིན་པ་འམ། ངག་སྙན་པ་འམ། དོན་བསྒྲུབ་པ་འམ། དོན་འཐུན་པས་དགེ་བའི་རྩ་བ་གང་ཅི་ཙམ་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ཇི་ལྟར་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་འགྱུར། གཙོ་བོར་འགྱུར། ཐུ་བོར་འགྱུར། ཕུལ་དུ་འགྱུར། དམ་པར་འགྱུར།
en: He has the power and skill to destroy the view of a self in beings, and in whatever roots of goodness he practices through generosity, kind words, actions that benefit others, and practicing what he preaches, among all beings he becomes supreme, the best, the foremost, the highest, the most excellent, the unsurpassable, the guide, the leader, the commander, and so on, up until becoming the omniscient one who is relied on.

source: བླ་ན་མེད་པར་འགྱུར། འདྲེན་པར་འགྱུར། ཡོངས་སུ་འདྲེན་པར་འགྱུར་བ་ནས། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་རྟེན་པའི་བར་དུ་འགྱུར་སྙམ་སྟེ། སངས་རྒྱས་ཡིད་ལ་བྱ་བ་དང་། ཆོས་ཡིད་ལ་བྱ་བ་དང་། དགེ་འདུན་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྦྱོང་བ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཡིད་ལ་བྱ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིད་ལ་བྱ་བ་དང་། སྟོབས་ཡིད་ལ་བྱ་བ་དང་། མི་འཇིགས་པ་ཡིད་ལ་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡིད་ལ་བྱ་བ་ནས་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་དུ་ཡིད་ལ་བྱ་བ་དང་། མི་འབྲལ་བ་ཡིན་ཏེ།
en: His mind is always focused on the Buddha, focused on the Dharma, focused on the Saṅgha, focused on the bodhisattvas, focused on bodhisattva conduct, focused on the bodhisattva bhūmis, focused on the perfections, focused on the strengths, focused on the confidences, focused on the unique qualities of buddhahood, and so on, up until being focused on the omniscient wisdom endowed with the supreme aspects.

source: དེ་འདོད་ན་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཏིང་ངེ་འཛིན་ཁྲག་ཁྲིག་རབ་ཏུ་ཐོབ་ཅིང་དེ་དག་ལ་སྙོམས་པར་འཇུག་པ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་མཐོང་ཞིང་དེ་དག་གི་བྱིན་གྱི་རླབས་ཀྱང་ཡང་དག་པར་ཤེས་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཁྲག་ཁྲིག་སྐྱོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཁྲག་ཁྲིག་དུ་འགྲོ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཁྲག་ཁྲིག་སྣང་བར་བྱ་བ་དང་། སེམས་ཅན་ཁྲག་ཁྲིག་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། བསྐལ་པ་ཁྲག་ཁྲིག་དུ་གནས་པར་བྱ་བ་དང་། སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའི་བསྐལ་པ་ཁྲག་ཁྲིག་ལ་རབ་ཏུ་འཇུག་པ་དང་། ཆོས་ཀྱི་སྒོ་ཁྲག་ཁྲིག་རྣམ་པར་འབྱེད་པ་དང་། ལུས་ཁྲག་ཁྲིག་ཡོངས་སུ་བསྟན་པ་དང་། ལུས་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཁྲག་ཁྲིག་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པ་དེ་ལྟ་བུ་རྩོམ་མོ། །དེ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་གྱི་མཐུ་ཅན་རྣམས་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་རྣམ་པར་འཕྲུལ་ཏེ། དེ་དག་གི་ལུས་སམ། འོད་དམ་རྫུ་འཕྲུལ་ལམ། མིག་གམ། སྤྱོད་ཡུལ་ལམ། དབྱངས་སམ།
en: “If he wishes to, he can apply himself in such a way that in just one instant he attains and rests in ten million samādhis, sees ten million buddhas and knows their blessings, causes ten million worlds to shake, goes to ten million buddha realms, illuminates ten million worlds, ripens ten million beings, remains for ten million eons, enters ten million previous eons and ten million future eons, opens ten million Dharma doors, manifests ten million bodies, and manifests each body having a retinue of ten million bodhisattvas.

source: སྤྱོད་པ་འམ། རྒྱན་ཏམ། བྱིན་གྱི་རླབས་སམ། མོས་པ་འམ། མངོན་པར་འདུ་བྱེད་པ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་བར་གྱིས་ཀྱང་བགྲང་བར་དཀའ་འོ།
en: “From this point on the bodhisattvas have the power of prayer, and through their particular prayers they emanate bodies, lights, miracles, sights, activities, voices, conduct, displays, blessings, transformations, and manifestations for many eons, for many hundreds of eons, for many thousands of eons, for many hundreds of thousands of eons, and for many innumerable and many quintillions of eons.”

source: །ས་གསུམ་འོད་བྱེད་པ་ལ་ཤིན་ཏུ་སྦྱངས་བྱས་ཤིང་།
en: “Having purified the third bhūmi, Shining,

source: །ནམ་མཁའི་ཁམས་དང་ཡིད་ཀྱི་ཁམས་དང་ཁམས་གསུམ་དང་། སེམས་ཅན་སྤྱོད་དང་ཆོས་དང་འཇིག་རྟེན་དཔྱོད་བྱེད་ཅིང་།
en: They analyze the activity of beings, the world, and likewise phenomena, The element of space, the element of mind, and the three realms,

source: །མོས་དང་བསམ་པ་རྣམ་པར་དག་པ་ཡང་དག་གནོན།
en: And they ascend with a pure intention and motivation.

source: །འོད་འཕྲོ་ཡོད་པའི་ས་ཐོབ་འཕྲལ་དུ་མཐུ་ཆེན་རྣམས།
en: “When a powerful one attains the bhūmi called Brilliance,

source: །སྟོན་པའི་རིགས་སུ་ཡང་དག་སྐྱེས་པས་ཕྱིར་མི་ལྡོག།
en: He is in the Teacher’s family and is even more irreversible,

source: །སངས་རྒྱས་ཆོས་དང་དགེ་འདུན་དཀོན་མཆོག་དང་མི་ཕྱེད།
en: Is stainless toward the Buddha Jewel and the Dharma and Saṅgha,

source: །སྐྱེ་ཞིང་འཇིག་དང་གནས་པ་བྱེད་པ་མེད་པ་ལྟར།
en: And regards arising, ceasing, and remaining with indifference.

source: །འཇིག་རྟེན་རྒྱུ་བའི་ལས་དང་བྱེད་དང་སྲིད་སྐྱེ་དང་། །མྱ་ངན་འདས་འཁོར་ཞིང་དང་སེམས་ཅན་རྣམ་པར་སྒོམ།
en: “He contemplates the karma that brings about worlds, actions, birth in existence, Saṃsāra and nirvāṇa, worlds and beings,

source: །སྔོན་དང་ཕྱི་མཐའ་ཟད་དང་སྐྱེ་མེད་གྲུབ་པ་དང་། །ལས་ལ་སྟོན་པའི་རིགས་ཀྱི་རྗེས་སུ་འབྲང་ཞིང་སྒོམ།
en: Phenomena, the past and future, annihilation, And becoming one who follows the family of the Teacher.

source: །དེ་དག་འདི་འདྲའི་ཆོས་ལྡན་ཕན་དང་བདེར་སེམས་པ།
en: “He acquires this Dharma and has beneficial compassion.

source: །ལུས་དང་དྲན་པ་ཚོར་བ་སེམས་དང་ཆོས་སྒོམ་སྟེ། །དྲན་པ་ཉེ་བར་གཞག་བསྒོམ་བརྟེན་པ་རྣམ་སྤངས་པ།
en: He meditates on the body and on sensation, mind, and phenomena.

source: །ཕྱི་དང་ནད་དང་གཉིས་ཀའི་རྣམ་པར་མཁས་པ་སྒོམ།
en: The wise one meditates on the internal, the external, and both.
